{
  "header": {
    "title": "Mi Portfolio",
    "home": "Inicio",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "contact": "Contacto",
    "language": "Idioma"
  },
  "carousel": {
    "slide": "Diapositiva {{num}}",
    "previous": "Anterior",
    "next": "Siguiente"
  },
  "presentation": {
    "hello": "¡Hola!, soy",
    "roles": {
      "fullstack": "Full Stack Developer",
      "desktop_mobile": "Enfocado en Apps de <b>Escritorio</b> y <b>Móvil</b>",
      "web_api": "Con experiencia en <b>Web</b> y <b>APIs REST</b>"
    },
    "about": "Recién graduado en Desarrollo de Aplicaciones Multiplataforma, con muchas ganas de incorporarme al sector y aportar mis conocimientos y habilidades."
  },
  "social": {
    "github": "Perfil de GitHub",
    "linkedin": "Perfil de LinkedIn"
  },
  "skills": {
    "title": "Mis Habilidades",
    "description": "🛠️ Estas son las tecnologías y herramientas que realmente domino. He incluido únicamente las que manejo con seguridad y confianza.",
    "categories": {
      "java_android": "🧩 Desarrollo en Java & Android",
      "web": "🌐 Desarrollo Web",
      "databases": "🗄️ Bases de Datos",
      "tools": "✨ Extras / Herramientas"
    }
  },
  "projects": {
    "title": "Mis Proyectos",
    "description": "📂 Estos son algunos de los proyectos que he desarrollado. <b>¡Ponte encima de ellos para ver más detalles!</b>",
    "goToRepo": "Ir al Repositorio",
    "transfernow": {
      "title": "TransferNow - Sistema FTP",
      "description": "Recreación de un sistema FTP con Spring. Tiene un sistema para poder organizar y gestionar los archivos que quieres subir y te da la posibilidad de compartir estos mediante puertos abiertos a parte de poder aceptar solicitudes de archivos de usuarios externos."
    },
    "rutas_cda": {
      "title": "RutasCdA - App",
      "description": "App en la que los usuarios siguen rutas físicas usando geolocalización, escanean códigos QR en los lugares y resuelven enigmas. Todo almacenado en la nube dejando un registro activo del progreso del usuario."
    },
    "library_web": {
      "title": "Gestión de Librería Web",
      "description": "Aplicación web para gestionar libros, categorías y autores mediante operaciones CRUD completas con ASP.NET. Incluye un sistema de login con roles y permisos para diferenciar administradores de usuarios, garantizando un control de acceso seguro y eficiente."
    },
    "gmg-funmenu": {
      "title": "GMG-FunMenu - Programa de Sonidos y TTS",
      "description": "Programa que permite a los jugadores activar sonidos, música o TTS en tiempo real mediante comandos en el juego. Incluye soporte para YouTube, mezclador de audio, sonidos personalizados y keybinds. Funciona de forma segura leyendo el log del juego, sin manipular la memoria y con control de administradores."
    }
  },
  "contact": {
    "title": "Mis Contactos",
    "description": "💬 Tienes varias opciones para ponerte en contacto conmigo. ¡Elije la que más te convenga!",
    "methods": {
      "email": {
        "title": "Correo Electrónico",
        "text": "Envíame un email directamente",
        "button": {
          "copy": "Copiar Email",
          "copied": "¡Copiado!"
        }
      },
      "linkedin": {
        "text": "Conectemos profesionalmente",
        "button": "Visitar Perfil"
      },
      "github": {
        "text": "Revisa mis proyectos",
        "button": "Ver Repositorios"
      }
    }
  }
}
